Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The core repositories have at least the following branches:
it_it: I repository principali hanno almeno i seguenti branch:

source: The corresponding values you will need to pass as the 2nd argument are the following:
it_it: I valori corrispondenti da passare come secondo argomento sono i seguenti:

source: The cost is 12 extra bytes per label in RAM.
it_it: Il costo è di 12 byte extra per ogni etichetta in RAM.

source: The create function returns an ``lv_obj_t *`` pointer which can be used to configure the widget later.
it_it: La funzione *create* restituisce un puntatore ``lv_obj_t *`` utilizzabile per configurare il widget in un secondo momento.

source: The create functions only have a ``parent`` parameter specifying on which widget to create the new widget.
it_it: Le funzioni create hanno solo un parametro ``parent`` che specifica su quale widget creare quello nuovo.

source: The created Screens can be deleted with :cpp:expr:`lv_obj_delete(scr)`, but be sure you do not delete the :ref:`active_screen`.
it_it: Gli Screen creati possono essere eliminati con :cpp:expr:`lv_obj_delete(scr)`, ma non si deve eliminare lo :ref:`active_screen`.

source: The created Widget is a normal LVGL Widget that can be used like any other manually-created Widget.
it_it: Il Widget creato è un normale Widget LVGL che può essere utilizzato come qualsiasi altro Widget creato manualmente.

source: The created snapshot is called "intermediate layer" or simply "layer".
it_it: L'istantanea creata è chiamata "intermediate layer" [livello intermedio] o semplicemente "layer".

source: The created timeline instances and their names are saved in the Component's instance.
it_it: Le istanze della timeline create e i relativi nomi vengono salvati nell'istanza del Componente.

source: The current event code can be retrieved with:
it_it: Il codice dell'evento corrente può essere recuperato con:

source: The current layer can be read from the ``base`` draw descriptor.
it_it: Il layer corrente può essere letto dal descrittore del disegno ``base``.

source: The current target layer can be retrieved using :cpp:expr:`lv_event_get_layer(e)`.
it_it: Il layer target corrente può essere recuperato utilizzando :cpp:expr:`lv_event_get_layer(e)`.

source: The cursor is normally always visible.
it_it: Il cursore è normalmente sempre visibile.

source: The cursor position can be modified programmatically using :cpp:expr:`lv_textarea_set_cursor_pos(textarea, cursor_pos)` where ``cursor_pos`` is the zero-based index of the character the cursor should be placed in front of.
it_it: La posizione del cursore può essere modificata a livello di codice utilizzando :cpp:expr:`lv_textarea_set_cursor_pos(textarea, cursor_pos)` dove ``cursor_pos`` è l'indice a partire da zero del carattere davanti al quale deve essere posizionato il cursore.

source: The cursor's area is always the bounding box of the current character.
it_it: L'area del cursore è sempre il riquadro di delimitazione del carattere corrente.

source: The custom path can be set via the :c:macro:`LV_CONF_PATH` define.
it_it: Il path personalizzato può essere impostato tramite la definizione :c:macro:`LV_CONF_PATH`.

source: The data itself is of various types:
it_it: I dati stessi sono di vario tipo:

source: The data lifetime must be managed by the user.
it_it: La durata dei dati deve essere gestita dall'utente.

source: The declaration of a map should look like ``const char * map[] = {"button1", "button2", "button3", NULL}``.
it_it: La dichiarazione di map dovrebbe essere simile a ``const char * map[] = {"button1", "button2", "button3", NULL}``.

source: The declaration of these functions is automatically exported in ``<widget_name>_gen.h``.
it_it: La dichiarazione di queste funzioni viene esportata automaticamente in ``<widget_name>_gen.h``.

source: The decoded format of a RAW image depends on the decoder.
it_it: Il formato decodificato di un'immagine RAW dipende dal decodificatore.

source: The decoded image is stored in RGBA pixel format.
it_it: L'immagine decodificata viene memorizzata in formato pixel RGBA.

source: The decoder supports both variable and file as image sources.
it_it: Il decoder supporta sia variabili che file come sorgenti di immagini.

source: The default :cpp:enumerator:`LV_DIR_BOTTOM` can be modified using :cpp:expr:`lv_dropdown_set_dir(dropdown, LV_DIR_LEFT)`.
it_it: Il default :cpp:enumerator:`LV_DIR_BOTTOM` può essere modificato con :cpp:expr:`lv_dropdown_set_dir(dropdown, LV_DIR_LEFT)`.

source: The default DPI of the displays is set by :c:macro:`LV_DPI_DEF` in ``lv_conf.h``, but it can be modified with:
it_it: Il DPI predefinito dei display è impostato da :c:macro:`LV_DPI_DEF` in ``lv_conf.h``, ma può essere modificato con:

source: The default animation mode is **play forward with loop**.
it_it: La modalità di animazione di default è **riproduci in avanti con loop**.

source: The default base direction for screens can be set by :c:macro:`LV_BIDI_BASE_DIR_DEF` in ``lv_conf.h`` and other Widgets inherit the base direction from their parent.
it_it: La direzione di base di default per le schermate può essere impostata tramite :c:macro:`LV_BIDI_BASE_DIR_DEF` in ``lv_conf.h`` e gli altri Widget ereditano la direzione di base dal loro genitore.

source: The default color format of the display is set according to :c:macro:`LV_COLOR_DEPTH` (see ``lv_conf.h``)
it_it: Il formato colore di default del display è impostato in base a :c:macro:`LV_COLOR_DEPTH` (vedere ``lv_conf.h``)

source: The default drawing direction is from left to right in horizontal orientation and bottom to top in vertical orientation.
it_it: La direzione di disegno di default è da sinistra a destra nell'orientamento orizzontale e dal basso verso l'alto nell'orientamento verticale.

source: The default filename will be the filename of the selected image file with a ``.c`` extension.
it_it: Il nome file di default sarà il nome del file immagine selezionato con estensione ``.c``.

source: The default is ``"0x20-0x7F"`` to cover the ASCII range.
it_it: Il default è ``"0x20-0x7F"`` per coprire l'intervallo ASCII.

source: The default min/max values are ``INT32_MIN`` (-2B) and ``INT32_MAX`` (+2B) respectively.
it_it: I valori min/max di default sono rispettivamente ``INT32_MIN`` (-2B) e ``INT32_MAX`` (+2B).

source: The default mode is :cpp:enumerator:`LV_IME_PINYIN_MODE_K26`.
it_it: La modalità di default è :cpp:enumerator:`LV_IME_PINYIN_MODE_K26`.

source: The default mode is :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_UPPER`.
it_it: La modalità di default è :cpp:enumerator:`LV_KEYBOARD_MODE_TEXT_UPPER`.

source: The default range is 0..100, and the default drawing direction is from left to right in horizontal mode and bottom to top in vertical mode.
it_it: L'intervallo di default è 0..100 e la direzione di disegno di default è da sinistra a destra in modalità orizzontale e dal basso verso l'alto in modalità verticale.

source: The default range is 0..100.
it_it: L'intervallo di default è 0..100.

source: The default range is the smallest and largest possible values, so there is no limit by default.
it_it: L'intervallo di default è il valore minimo e massimo possibile, quindi non ci sono limiti predefiniti.

source: The default range is: 0..100.
it_it: L'intervallo di default è 0..100.

source: The default read period is set by :c:macro:`LV_DEF_REFR_PERIOD` in ``lv_conf.h``.
it_it: Il periodo di lettura di default è impostato da :c:macro:`LV_DEF_REFR_PERIOD` in ``lv_conf.h``.

source: The default settings are 3 horizontal and 5 vertical division lines.
it_it: Le impostazioni di default sono 3 linee di divisione orizzontali e 5 verticali.

source: The default size is the screen size.
it_it: La dimensione di default è quella dello schermo.

source: The default value for this variable is "r0".
it_it: Il valore di default per questa variabile è "r0".

source: The default value is 0, so no image is cached.
it_it: Il valore di default è 0, quindi nessuna immagine viene memorizzata nella cache.

source: The default value is 10.
it_it: Il valore di default è 10.

source: The default value is :cpp:enumerator:`LV_OPA_TRANSP` causing this feature to be disabled.
it_it: Il valore di default è :cpp:enumerator:`LV_OPA_TRANSP`, che disabilita questa funzionalità.

source: The default value is :cpp:expr:`LV_DRAW_SW_DRAW_UNIT_CNT` (or 1 if software rendering is not enabled).
it_it: Il valore di default è :cpp:expr:`LV_DRAW_SW_DRAW_UNIT_CNT` (o 1 se il rendering software non è abilitato).

source: The default values are quite sane and reasonable, so usually only a few fields need modification.
it_it: I valori di default sono abbastanza sensati e ragionevoli, quindi in genere solo pochi campi necessitano di modifiche.

source: The default values for tessellation width and height, and command buffer size are in the SDK file "vglite_support.h".
it_it: I valori di default per la larghezza e l'altezza della tassellatura e la dimensione del buffer dei comandi si trovano nel file SDK "vglite_support.h".

source: The delay is expressed in milliseconds.
it_it: Il ritardo è espresso in millisecondi.

source: The descriptors store the targets' names as strings.
it_it: I descrittori memorizzano i nomi dei target come stringhe.

source: The destination directory.
it_it: Directory di destinazione.

source: The developer should take responsibility for restructuring the design with a developer mindset to ensure a maintainable, clean, and optimal structure.
it_it: Lo sviluppatore dovrebbe assumersi la responsabilità di ristrutturare il design con una mentalità da sviluppatore per garantire una struttura manutenibile, pulita e ottimale.

source: The device vendor provides an arm-2d compliant driver for their proprietary 2D accelerators and/or ACI (Arm Customized Instruction).
it_it: Il fornitore del dispositivo fornisce un driver compatibile con ARM-2D per i propri acceleratori 2D proprietari e/o ACI (Arm Customized Instruction).

source: The difference between load and create is that:
it_it: La differenza tra load e create è che:

source: The direction in which scrolling happens can be controlled by :cpp:expr:`lv_obj_set_scroll_dir(widget, LV_DIR_...)`.
it_it: La direzione dello scorrimento può essere controllata da :cpp:expr:`lv_obj_set_scroll_dir(widget, LV_DIR_...)`.

source: The direction setting can be :cpp:enumerator:`LV_DIR_HOR` or :cpp:enumerator:`LV_DIR_VER`.
it_it: L'impostazione della direzione può essere :cpp:enumerator:`LV_DIR_HOR` o :cpp:enumerator:`LV_DIR_VER`.

source: The directory structure will be preserved.
it_it: La struttura delle directory verrà mantenuta.

source: The directory within the Build Directory in which the OpenEmbedded build system places generated objects during a recipe's build process.
it_it: La directory all'interno della Build Directory in cui il sistema di build OpenEmbedded inserisce gli oggetti generati durante il processo di build di una ricetta.

source: The display area can be specified in internal GRAM by window address function.
it_it: L'area di visualizzazione può essere specificata nella GRAM interna tramite la funzione di indirizzo finestra.

source: The draw API can be used in these cases and the current layer can be used differently in each case:
it_it: In questi casi è possibile utilizzare l'API di disegno e il layer corrente può essere utilizzato in modo diverso:

source: The draw functions can draw to any color format to which LVGL can render.
it_it: Le funzioni di disegno possono disegnare in qualsiasi formato colore supportato da LVGL.

source: The draw tasks that the LVGL DMA2D draw unit can render are fills and images.
it_it: I task di disegno che la "draw unit" DMA2D di LVGL può eseguire sono riempimenti e immagini.

source: The driver can be used to create multiple displays.
it_it: Il driver può essere utilizzato per creare più display.

source: The driver supports display rotation with :cpp:expr:`lv_display_set_rotation(disp, rotation)` where rotation is one of :cpp:enumerator:`LV_DISP_ROTATION_90`, :cpp:enumerator:`LV_DISP_ROTATION_180`, or :cpp:enumerator:`LV_DISP_ROTATION_270`.
it_it: Il driver supporta la rotazione del display con :cpp:expr:`lv_display_set_rotation(disp, rotation)` dove rotation è una tra :cpp:enumerator:`LV_DISP_ROTATION_90`, :cpp:enumerator:`LV_DISP_ROTATION_180` o :cpp:enumerator:`LV_DISP_ROTATION_270`.

source: The driver will use the information in the LTDC layer configuration to find the layer's framebuffer and flush to it.
it_it: Il driver utilizzerà le informazioni nella configurazione del layer LTDC per trovare il framebuffer del layer e scaricarlo.

source: The driver within LVGL is designed to work with an already-configured LTDC peripheral.
it_it: Il driver all'interno di LVGL è progettato per funzionare con una periferica LTDC già configurata.

source: The driver's ``seek`` will not actually be called unless the ``whence`` is ``LV_FS_SEEK_END``, in which case ``seek`` and ``tell`` will be called to determine where the end of the file is.
it_it: La funzione ``seek`` del driver non verrà effettivamente chiamata a meno che ``whence`` non sia ``LV_FS_SEEK_END``, nel qual caso verranno chiamati ``seek`` e ``tell`` per determinare dove si trova la fine del file.

source: The driver's ``tell`` will not actually be called.
it_it: La funzione ``tell`` del driver non verrà effettivamente chiamata.

source: The drivers are as implied by the macro names.
it_it: I driver sono quelli indicati dai nomi delle macro.

source: The easiest way to create a custom image is to use the online image converter and select ``RAW`` or ``RAW_WITH_ALPHA`` format.
it_it: Il modo più semplice per creare un'immagine personalizzata è utilizzare il convertitore di immagini online e selezionare il formato ``RAW`` o ``RAW_WITH_ALPHA``.

source: The effect can be observed in the "Containers with opa_layer" scene of the benchmark demo in the border corners.
it_it: L'effetto può essere osservato nella scena "Containers with opa_layer" della demo del benchmark negli angoli del bordo.

source: The elements in each array are JSON objects, each with a structure unique to the type indicated by the parent element name (e.g. "enums", "functions", etc.).
it_it: Gli elementi di ogni array sono oggetti JSON, ciascuno con una struttura univoca per il tipo indicato dal nome dell'elemento genitore (ad esempio "enum", "function", ecc.).

source: The entry point is contained in ``lv_port_linux/src/main.c``.
it_it: Il punto di ingresso è contenuto in ``lv_port_linux/src/main.c``.

source: The entry point is contained in ``src/LVGL_thread_entry.c``.
it_it: Il punto di ingresso è contenuto in ``src/LVGL_thread_entry.c``.

source: The entry point is contained in ``src/main.c``.
it_it: Il punto di ingresso è contenuto in ``src/main.c``.

source: The entry point of the main task is contained in ``src/LVGL_thread_entry.c``.
it_it: Il punto di ingresso del task principale è contenuto in ``src/LVGL_thread_entry.c``.

source: The environment is now set up, and we're ready to build an application using the ``lv_benchmark`` repository that is inspired from `lv_port_linux <https://github.com/lvgl/lv_port_linux>`_.
it_it: L'ambiente è ora configurato e siamo pronti per compilare un'applicazione utilizzando il repository ``lv_benchmark`` ispirato a `lv_port_linux <https://github.com/lvgl/lv_port_linux>`_.

source: The esp_lvgl_port supports LVGL versions 8 and 9 and is compatible with ESP-IDF v4.4 and above.
it_it: esp_lvgl_port supporta le versioni LVGL 8 e 9 ed è compatibile con ESP-IDF v4.4 e successive.

source: The event codes can be grouped into these categories: - Input device events - Drawing events - Other events - Special events - Custom events
it_it: I codici evento possono essere raggruppati in queste categorie: - Eventi dei dispositivi di input - Eventi di disegno - Altri eventi - Eventi speciali - Eventi personalizzati

source: The event data contains the ID of the pressed/released button.
it_it: I dati dell'evento contengono l'ID del pulsante premuto/rilasciato.

source: The event data is ``char *`` being inserted.
it_it: I dati dell'evento sono ``char *`` in fase di inserimento.

source: The event happens on transition to/from the checked state.
it_it: L'evento si verifica durante la transizione da/verso lo stato selezionato.

source: The event is sent continuously while the Slider is being dragged.
it_it: L'evento viene inviato continuamente mentre lo Slider viene trascinato

source: The event parameter is :cpp:type:`int32_t` ``*`` to store the size.
it_it: Il parametro evento è :cpp:type:`int32_t` ``*`` per memorizzare le dimensioni.

source: The event parameter is :cpp:type:`lv_cover_check_info_t` ``*``.
it_it: Il parametro evento è :cpp:type:`lv_cover_check_info_t` ``*``.

source: The event parameter is ``NULL`` or an ``lv_anim_t *`` with a scroll animation descriptor that can be modified if required.
it_it: Il parametro event è ``NULL`` o ``lv_anim_t *`` con un descrittore di animazione di scorrimento che può essere modificato se necessario.

source: The event parameter is a pointer to the animation of the scroll.
it_it: Il parametro "event" è un puntatore all'animazione dello "scroll".

source: The event parameter is set to the ID of the pressed/released button.
it_it: Il parametro event è impostato sull'ID del pulsante premuto/rilasciato.

source: The event parameter is the text about to be inserted.
it_it: Il parametro evento è il testo che sta per essere inserito.

source: The events will be called in the order as they were added.
it_it: Gli eventi verranno richiamati nell'ordine in cui sono stati aggiunti.

source: The exact configuration depends on your flash size and existing partitions, but the new final result should look something like this:
it_it: La configurazione esatta dipende dalle dimensioni della flash e dalle partizioni esistenti, ma il nuovo risultato finale dovrebbe essere simile a questo:

source: The example app called ``lvgldemo`` uses LVGL's NuttX integration to run the demos in NuttX.
it_it: L'app di esempio chiamata ``lvgldemo`` usa l'integrazione NuttX di LVGL per eseguire le demo in NuttX.

source: The example below shows how to read from a file:
it_it: L'esempio seguente mostra come leggere da un file:

source: The example project should be examined for details, but in general the changes involve:
it_it: Il progetto di esempio dovrebbe essere esaminato per i dettagli, ma in generale le modifiche riguardano:

source: The executable created in the previous image is copied to the ``/usr/bin`` directory of the current image.
it_it: L'eseguibile creato nell'immagine precedente viene copiato nella directory ``/usr/bin`` dell'immagine corrente.

source: The exported C code can simply be dropped into the project and compiled into the application.
it_it: Il codice C esportato può essere semplicemente inserito nel progetto e compilato nell'applicazione.

source: The exported code looks like this:
it_it: Il codice esportato si presenta così:

source: The family offers miniaturized modules based on NXP\ |reg| i.MX 8X, i.MX 6ULL, i.MX 7, i.MX 6, Vybrid and NVIDIA\ |reg| Tegra SoCs.
it_it: La famiglia offre moduli miniaturizzati basati su NXP\ |reg| i.MX 8X, i.MX 6ULL, i.MX 7, i.MX 6, Vybrid e NVIDIA\ |reg| Tegra SoCs.

source: The fetch Repo address has to be stored in **SRC_URI** variable.
it_it: L'indirizzo del Repository di recupero dev'essere memorizzato nella variabile **SRC_URI**.

source: The ffmpeg player uses software decoding by default.
it_it: Il lettore ffmpeg utilizza la decodifica software per default.

source: The file ``./src/font/lv_symbol_def.h`` contains a wide variety of Unicode symbols you can use directly, or you can make your own.
it_it: Il file ``./src/font/lv_symbol_def.h`` contiene un'ampia varietà di simboli Unicode che è possibile utilizzare direttamente o creare personalizzati.

source: The file must remain open the entire time the font is being used.
it_it: Il file deve rimanere aperto per tutto il tempo in cui il font viene utilizzato.

source: The final diff is calculated as:
it_it: La differenza finale viene calcolata come:

source: The first 5 macros append the following information to your ``text``:
it_it: Le prime 5 macro aggiungono le seguenti informazioni al ``text``:

source: The first is similar to how LVGL is used on other systems.
it_it: Il primo è simile a come LVGL viene utilizzato su altri sistemi.

source: The first parameter of the ``lv_draw_rect/label/etc`` functions is a layer.
it_it: Il primo parametro delle funzioni ``lv_draw_rect/label/etc`` è un layer.

source: The first time a screen is shown, there may be a noticeable delay while an image or set of glyphs is uploaded for use for the first time.
it_it: La prima volta che viene visualizzata una schermata, potrebbe verificarsi un ritardo notevole durante il caricamento di un'immagine o di un set di glifi per il primo utilizzo.

source: The first time you launch |lvglpro|, it will pop up a window with the message
it_it: Al primo avvio di |lvglpro|, verrà visualizzata una finestra con il messaggio

source: The focal point's circle should be inside the main circle.
it_it: Il cerchio del punto focale dovrebbe trovarsi all'interno di quello principale.

source: The focused object will receive the keys and other related events.
it_it: L'oggetto con focus riceverà i tasti e altri eventi correlati.

source: The folder location can be changed with the ``DL_DIR`` variable.
it_it: La posizione della cartella può essere modificata con la variabile ``DL_DIR``.

source: The folder pointed to by the URL needs to contain a ``project.xml`` and ``globals.xml``.
it_it: La cartella a cui punta l'URL deve contenere i file ``project.xml`` e ``globals.xml``.

source: The following *Keys* are processed by Checkbox:
it_it: I seguenti *Tasti* vengono elaborati dalla casella di controllo:

source: The following *Keys* are processed by Table Widgets:
it_it: I seguenti *tasti* vengono elaborati dai Widget Table:

source: The following API functions allow programmatic scrolling of Widgets:
it_it: Le seguenti funzioni API consentono lo scorrimento programmatico dei Widget:

source: The following Grid-related style properties exist:
it_it: Esistono le seguenti proprietà di stile relative alla Grid:

source: The following abbreviations are used and allowed:
it_it: Sono utilizzate e consentite le seguenti abbreviazioni:

source: The following are developer notes on how to build lvgljs on your native platform.
it_it: Di seguito sono riportate alcune note per sviluppatori su come compilare lvgljs sulla piattaforma nativa.

source: The following arguments are the local patch files that will be applied to the source code during the build process.
it_it: I seguenti argomenti sono i file di patch locali che verranno applicati al codice sorgente durante il processo di build.

source: The following code demonstrates using the driver in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` mode, please notice in this mode of operation the application is responsible to allocate the framebuffers space and pass them to the display, in the example below `buffer1` and `buffer2` are the current and the next buffers that will be copied to the display screen, being swapped at each flush operation (managed internally by the display driver).
it_it: Il codice seguente illustra l'utilizzo del driver in modalità :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT`. Si noti che in questa modalità di funzionamento l'applicazione è responsabile dell'allocazione dello spazio dei framebuffer e del loro passaggio al display. Nell'esempio seguente `buffer1` e `buffer2` sono il buffer corrente e quello successivo che verranno copiati sullo schermo, scambiati a ogni operazione di flush (gestita internamente dal driver del display).
